package example;

public class ForExample {
	public static void main(String[] args) {
		//본인 이름을 화면에 7번 출력하세요.
		//ex) 진주현 진주현  ....
		for(int i = 1; i <= 7; i++) {
			System.out.print("진주현 ");
		}
		System.out.println("========================================");
		
		//1~10 범위의 정수 중 홀수를 화면에 출력하세요.
		//ex) 1  3  5  7  9
		System.out.println("========================================");
		
		//1~100 범위의 정수에서 3의 배수들의 합계와 5의 배수들의 합계를 계산하여
		//3의 배수의 합계에서 5의 배수의 합계를 뺀 결과를 출력하세요.
		//ex) 결과 = 633
		for(int i = 1; i <= 100; i++) {
			
		}
		System.out.println("========================================");
		
		//구구단 중 7단을 화면에 출력하세요.
		//ex) 7 * 1 = 7
		//    7 * 2 = 14
		//      ...
		//    7 * 9 = 63
		System.out.println("========================================");
		
		//5!의 결과값을 계산하여 결과값을 출력하세요.(5! = 5 * 4 * 3 * 2 * 1)
		//ex)5! = 120
		System.out.println("========================================");
		
		//두 변수에 저장된 정수값 사이의 정수들을 화면에 출력하세요.
		//단, 한 줄에 정수값이 7개씩 출력되도록 작성하세요.
		//ex) 36 27 38 39 40 41 42
		int begin = 36, end = 57;
		System.out.println("========================================");
	}
}
